damowuhe/cw32l012_hal_cmake/cw32l012.svd
        <register>
          <name>ISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TERRF</name>
              <description>desc TERRF</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>IERRF</name>
              <description>desc IERRF</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>DIRF</name>
              <description>desc DIRF</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>IDXF</name>
              <description>desc IDXF</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC6OF</name>
              <description>desc CC6OF</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC5OF</name>
              <description>desc CC5OF</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC6IF</name>
              <description>desc CC6IF</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC5IF</name>
              <description>desc CC5IF</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SBIF</name>
              <description>desc SBIF</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC4OF</name>
              <description>desc CC4OF</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC3OF</name>
              <description>desc CC3OF</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC2OF</name>
              <description>desc CC2OF</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC1OF</name>
              <description>desc CC1OF</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>B2IF</name>
              <description>desc B2IF</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>BIF</name>
              <description>desc BIF</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TIF</name>
              <description>desc TIF</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>COMIF</name>
              <description>desc COMIF</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC4IF</name>
              <description>desc CC4IF</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC3IF</name>
              <description>desc CC3IF</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC2IF</name>
              <description>desc CC2IF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CC1IF</name>
              <description>desc CC1IF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>UIF</name>
              <description>desc UIF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <description>Event generation register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CC6G</name>
              <description>desc CC6G</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC5G</name>
              <description>desc CC5G</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>B2G</name>
              <description>desc B2G</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BG</name>
              <description>desc BG</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TG</name>
              <description>desc TG</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMG</name>
              <description>desc COMG</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4G</name>
              <description>desc CC4G</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3G</name>
              <description>desc CC3G</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2G</name>
              <description>desc CC2G</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1G</name>
              <description>desc CC1G</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>UG</name>
              <description>desc UG</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1CAP</name>
          <description>capture compare mode register 1</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC2F</name>
              <description>desc IC2F</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC2PSC</name>
              <description>desc IC2PSC</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2S</name>
              <description>desc CC2S</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC1F</name>
              <description>desc IC1F</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC1PSC</name>
              <description>desc IC1PSC</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1CMP</name>
          <description>capture compare mode register 1</description>
          <alternateRegister>CCMR1CAP</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OC2MH</name>
              <description>desc OC2MH</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1MH</name>
              <description>desc OC1MH</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC2CE</name>
              <description>desc OC2CE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC2M</name>
              <description>desc OC2M</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC2PE</name>
              <description>desc OC2PE</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC2FE</name>
              <description>desc OC2FE</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC2S</name>
              <description>desc CC2S</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1CE</name>
              <description>desc OC1CE</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1M</name>
              <description>desc OC1M</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1PE</name>
              <description>desc OC1PE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC1FE</name>
              <description>desc OC1FE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC1S</name>
              <description>desc CC1S</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2CAP</name>
          <description>capture compare mode register 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC4F</name>
              <description>desc IC4F</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC4PSC</name>
              <description>desc IC4PSC</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4S</name>
              <description>desc CC4S</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC3F</name>
              <description>desc IC3F</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC3PSC</name>
              <description>desc IC3PSC</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3S</name>
              <description>desc CC3S</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2CMP</name>
          <description>capture compare mode register 2</description>
          <alternateRegister>CCMR2CAP</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OC4MH</name>
              <description>desc OC4MH</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC3MH</name>
              <description>desc OC3MH</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC4CE</name>
              <description>desc OC4CE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC4M</name>
              <description>desc OC4M</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC4PE</name>
              <description>desc OC4PE</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC4FE</name>
              <description>desc OC4FE</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC4S</name>
              <description>desc CC4S</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC3CE</name>
              <description>desc OC3CE</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC3M</name>
              <description>desc OC3M</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC3PE</name>
              <description>desc OC3PE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC3FE</name>
              <description>desc OC3FE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC3S</name>
              <description>desc CC3S</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR3CAP</name>
          <description>capture compare mode register 3</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IC6F</name>
              <description>desc IC6F</description>
              <msb>15</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC6PSC</name>
              <description>desc IC6PSC</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC6S</name>
              <description>desc CC6S</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC5F</name>
              <description>desc IC5F</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IC5PSC</name>
              <description>desc IC5PSC</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC5S</name>
              <description>desc CC5S</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR3CMP</name>
          <description>capture compare mode register 3</description>
          <alternateRegister>CCMR3CAP</alternateRegister>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OC6MH</name>
              <description>desc OC6MH</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC5MH</name>
              <description>desc OC5MH</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC6CE</name>
              <description>desc OC6CE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC6M</name>
              <description>desc OC6M</description>
              <msb>14</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC6PE</name>
              <description>desc OC6PE</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC6FE</name>
              <description>desc OC6FE</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC6S</name>
              <description>desc CC6S</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC5CE</name>
              <description>desc OC5CE</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC5M</name>
              <description>desc OC5M</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC5PE</name>
              <description>desc OC5PE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OC5FE</name>
              <description>desc OC5FE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CC5S</name>
              <description>desc CC5S</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
