damowuhe/cw32l012_hal_cmake/cw32l012.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="BTIM1">
      <name>BTIM2</name>
      <description>Base Timer 2</description>
      <baseAddress>0x40004840</baseAddress>
      <interrupt>
        <name>BTIM2</name>
        <description>Base Timer2 Interrupt</description>
        <value>21</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="BTIM1">
      <name>BTIM3</name>
      <description>Base Timer 3</description>
      <baseAddress>0x40004880</baseAddress>
      <interrupt>
        <name>BTIM3_HALLTIM</name>
        <description>Base Timer3 and Hall timer Interrupt</description>
        <value>22</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>CORDIC</name>
      <description>desc CORDIC</description>
      <baseAddress>0x40023400</baseAddress>
      <interrupt>
        <name>CORDIC</name>
        <description>desc CORDIC</description>
        <value>11</value>
      </interrupt>
      <headerStructName>CORDIC</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <description>Control and State register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>desc BUSY</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>EOC</name>
              <description>desc EOC</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>DMAIDLE</name>
              <description>desc DMAIDLE</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEOC</name>
              <description>desc DMAEOC</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>desc IE</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>COMP</name>
              <description>desc COMP</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ITER</name>
              <description>desc ITER</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FORMAT</name>
              <description>desc FORMAT</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCALE</name>
              <description>desc SCALE</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FUNC</name>
              <description>desc FUNC</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>X</name>
          <description>Data register X</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>X</name>
              <description>desc X</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Y</name>
          <description>Data register Y</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>Y</name>
              <description>desc Y</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>Z</name>
          <description>desc Z</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>Z</name>
              <description>desc Z</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC</name>
      <description>desc CRC</description>
      <baseAddress>0x40023000</baseAddress>
      <headerStructName>CRC</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MODE</name>
              <description>desc MODE</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>Data register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DR</name>
              <description>desc DR</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>desc RESULT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
