damowuhe/cw32l012_hal_cmake/cw32l012.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DAC</name>
      <description>desc DAC</description>
      <baseAddress>0x400000C0</baseAddress>
      <interrupt>
        <name>ADC2_DAC</name>
        <description>ADC2 and DAC Interrupt</description>
        <value>30</value>
      </interrupt>
      <headerStructName>DAC</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x38</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR0</name>
          <description>Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DMAUDRIE2</name>
              <description>desc DMAUDRIE2</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN2</name>
              <description>desc DMAEN2</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MAMP2</name>
              <description>desc MAMP2</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE2</name>
              <description>desc WAVE2</description>
              <msb>23</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEL2</name>
              <description>desc TSEL2</description>
              <msb>21</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEN2</name>
              <description>desc TEN2</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN2</name>
              <description>desc EN2</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAUDRIE1</name>
              <description>desc DMAUDRIE1</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN1</name>
              <description>desc DMAEN1</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MAMP1</name>
              <description>desc MAMP1</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WAVE1</name>
              <description>desc WAVE1</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TSEL1</name>
              <description>desc TSEL1</description>
              <msb>5</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEN1</name>
              <description>desc TEN1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN1</name>
              <description>desc EN1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRGR</name>
          <description>Data register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SWTRIG2</name>
              <description>desc SWTRIG2</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SWTRIG1</name>
              <description>desc SWTRIG1</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R1</name>
          <description>desc DHR12R1</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L1</name>
          <description>desc DHR12L1</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>15</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R1</name>
          <description>desc DHR8R1</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12R2</name>
          <description>desc DHR12R2</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12L2</name>
          <description>desc DHR12L2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>15</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8R2</name>
          <description>desc DHR8R2</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12RD</name>
          <description>desc DHR12RD</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C2DATA</name>
              <description>desc C2DATA</description>
              <msb>27</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>C1DATA</name>
              <description>desc C1DATA</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR12LD</name>
          <description>desc DHR12LD</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C2DATA</name>
              <description>desc C2DATA</description>
              <msb>31</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>C1DATA</name>
              <description>desc C1DATA</description>
              <msb>15</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DHR8RD</name>
          <description>desc DHR8RD</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C2DATA</name>
              <description>desc C2DATA</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>C1DATA</name>
              <description>desc C1DATA</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR1</name>
          <description>desc DOR1</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DMAUDR</name>
              <description>desc DMAUDR</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DOR2</name>
          <description>desc DOR2</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DMAUDR</name>
              <description>desc DMAUDR</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>Result register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>C2OUT</name>
              <description>desc C2OUT</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>C1OUT</name>
              <description>desc C1OUT</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
