damowuhe/cw32l012_hal_cmake/cw32l012.svd
        <register>
          <name>SRCADDR3</name>
          <description>Channel1 source address register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>desc SRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTADDR3</name>
          <description>Channel1 destination address register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSTADDR</name>
              <description>desc DSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG3</name>
          <description>Channel1 trigger register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HARDSRC</name>
              <description>desc HARDSRC</description>
              <msb>7</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTSRC</name>
              <description>desc SOFTSRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>desc TYPE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT3</name>
          <description>Channel1 trigger register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CREPEAT</name>
              <description>desc CREPEAT</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCNT</name>
              <description>desc CCNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRCADDR3</name>
          <description>Channel1 source address register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CSRCADDR</name>
              <description>desc CSRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDSTADDR3</name>
          <description>Channel1 destination address register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CDSTADDR</name>
              <description>desc CDSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR4</name>
          <description>Channel1 control and status register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSTLOAD</name>
              <description>desc DSTLOAD</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCLOAD</name>
              <description>desc SRCLOAD</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TE</name>
              <description>desc TE</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TC</name>
              <description>desc TC</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESTART</name>
              <description>desc RESTART</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>STATUS</name>
              <description>desc STATUS</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SIZE</name>
              <description>desc SIZE</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DSTINC</name>
              <description>desc DSTINC</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SRCINC</name>
              <description>desc SRCINC</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRANS</name>
              <description>desc TRANS</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TEIE</name>
              <description>desc TEIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TCIE</name>
              <description>desc TCIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT4</name>
          <description>Channel1 counter register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>REPEAT</name>
              <description>desc REPEAT</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT</name>
              <description>desc CNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCADDR4</name>
          <description>Channel1 source address register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SRCADDR</name>
              <description>desc SRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSTADDR4</name>
          <description>Channel1 destination address register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DSTADDR</name>
              <description>desc DSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIG4</name>
          <description>Channel1 trigger register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>HARDSRC</name>
              <description>desc HARDSRC</description>
              <msb>7</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTSRC</name>
              <description>desc SOFTSRC</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TYPE</name>
              <description>desc TYPE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCNT4</name>
          <description>Channel1 trigger register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CREPEAT</name>
              <description>desc CREPEAT</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CCNT</name>
              <description>desc CCNT</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRCADDR4</name>
          <description>Channel1 source address register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CSRCADDR</name>
              <description>desc CSRCADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CDSTADDR4</name>
          <description>Channel1 destination address register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CDSTADDR</name>
              <description>desc CDSTADDR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
