damowuhe/cw32l012_hal_cmake/cw32l012.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="DMACHANNEL1">
      <name>DMACHANNEL2</name>
      <description>DMA Channel 2</description>
      <baseAddress>0x40020040</baseAddress>
      <alternatePeripheral>DMA</alternatePeripheral>
      <interrupt>
        <name>DMACH12</name>
        <description>DMA Channel 1/2 Interrupt</description>
        <value>9</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="DMACHANNEL1">
      <name>DMACHANNEL3</name>
      <description>DMA Channel 3</description>
      <baseAddress>0x40020060</baseAddress>
      <alternatePeripheral>DMA</alternatePeripheral>
      <interrupt>
        <name>DMACH34</name>
        <description>DMA Channel 3/4 Interrupt</description>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="DMACHANNEL1">
      <name>DMACHANNEL4</name>
      <description>DMA Channel 4</description>
      <baseAddress>0x40020080</baseAddress>
      <alternatePeripheral>DMA</alternatePeripheral>
      <interrupt>
        <name>DMACH34</name>
        <description>DMA Channel 3/4 Interrupt</description>
        <value>10</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>EAU</name>
      <description>desc EAU</description>
      <baseAddress>0x40023200</baseAddress>
      <headerStructName>EAU</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSR</name>
          <description>desc CSR</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>desc BUSY</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ZERO</name>
              <description>desc ZERO</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>OVR</name>
              <description>desc OVR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>desc MODE</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVIDEND</name>
          <description>desc DIVIDEND</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIVIDEND</name>
              <description>desc DIVIDEND</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVISOR</name>
          <description>desc DIVISOR</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DIVISOR</name>
              <description>desc DIVISOR</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QUOTIENT</name>
          <description>desc QUOTIENT</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>QUOTIENT</name>
              <description>desc QUOTIENT</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAINDER</name>
          <description>desc REMAINDER</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>REMAINDER</name>
              <description>desc REMAINDER</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>desc FLASH</description>
      <baseAddress>0x40022000</baseAddress>
      <interrupt>
        <name>FLASHRAM</name>
        <description>Flash/RAM Interrupt</description>
        <value>3</value>
      </interrupt>
      <headerStructName>FLASH</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x74</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <description>Control register1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>SECURITY</name>
              <description>desc SECURITY</description>
              <msb>6</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>MODE</name>
              <description>desc MODE</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>Control register2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>CACHEINVALID</name>
              <description>desc CACHEINVALID</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHE</name>
              <description>desc CACHE</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FETCH</name>
              <description>desc FETCH</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WAIT</name>
              <description>desc WAIT</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PAGELOCK</name>
          <description>Page Write Erase Lock</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>desc KEY</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>LOCK15</name>
              <description>Page120 - 127</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK14</name>
              <description>Page112 - 119</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK13</name>
              <description>Page104 - 111</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK12</name>
              <description>Page96 - 103</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK11</name>
              <description>Page88 - 95</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK10</name>
              <description>Page80 - 87</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK9</name>
              <description>Page72 - 79</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK8</name>
              <description>Page64 - 71</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK7</name>
              <description>Page56 - 63</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK6</name>
              <description>Page48 - 55</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK5</name>
              <description>Page40 - 47</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK4</name>
              <description>Page32 - 39</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK3</name>
              <description>Page24 - 31</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK2</name>
              <description>Page16 - 23</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK1</name>
              <description>Page8 - 15</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK0</name>
              <description>Page0 - 7</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt enable register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PROG</name>
              <description>desc PROG</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHEON</name>
              <description>desc CACHEON</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SDKERR</name>
              <description>desc SDKERR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGELOCK</name>
              <description>desc PAGELOCK</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PC</name>
              <description>desc PC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt status register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSY</name>
              <description>desc BUSY</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PROG</name>
              <description>desc PROG</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CACHEON</name>
              <description>desc CACHEON</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SDKERR</name>
              <description>desc SDKERR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PAGELOCK</name>
              <description>desc PAGELOCK</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PC</name>
              <description>desc PC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt flag clear register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PROG</name>
              <description>desc PROG</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CACHEON</name>
              <description>desc CACHEON</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SDKERR</name>
              <description>desc SDKERR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PAGELOCK</name>
              <description>desc PAGELOCK</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PC</name>
              <description>desc PC</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDKCFR</name>
          <description>SDK config register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>END</name>
              <description>desc END</description>
              <msb>14</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>START</name>
              <description>desc START</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
