damowuhe/cw32l012_hal_cmake/cw32l012.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GTIM1">
      <name>GTIM2</name>
      <description>General Timer 2</description>
      <baseAddress>0x40001C00</baseAddress>
      <interrupt>
        <name>GTIM2</name>
        <description>General Timer1 Interrupt</description>
        <value>17</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GTIM1">
      <name>GTIM3</name>
      <description>General Timer 3</description>
      <baseAddress>0x40002400</baseAddress>
      <interrupt>
        <name>GTIM34</name>
        <description>General Timer3_4 Interrupt</description>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GTIM1">
      <name>GTIM4</name>
      <description>General Timer 4</description>
      <baseAddress>0x40002800</baseAddress>
      <interrupt>
        <name>GTIM34</name>
        <description>General Timer3_4 Interrupt</description>
        <value>18</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>HALLTIM</name>
      <description>HALL Timer </description>
      <baseAddress>0x40006400</baseAddress>
      <interrupt>
        <name>BTIM3_HALLTIM</name>
        <description>Base Timer3 and Hall timer Interrupt</description>
        <value>22</value>
      </interrupt>
      <headerStructName>HALLTIM</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>Control register1</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SOFTCAP</name>
              <description>desc SOFTCAP</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT2LEN</name>
              <description>desc FLT2LEN</description>
              <msb>22</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MMS</name>
              <description>desc MMS</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV</name>
              <description>desc DIV</description>
              <msb>3</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLT1EN</name>
              <description>desc FLT1EN</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <description>DMA and Interrupt register2</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SOFTDMA</name>
              <description>desc SOFTDMA</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCHDMA</name>
              <description>desc MATCHDMA</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OVDMA</name>
              <description>desc OVDMA</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPDMA</name>
              <description>desc CAPDMA</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCHIE</name>
              <description>desc MATCHIE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OVIE</name>
              <description>desc OVIE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPIE</name>
              <description>desc CAPIE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>counter register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>23</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <description>Auto Reload Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>23</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WIDTH</name>
          <description>Width Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>23</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>Compare control Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>23</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt states register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MATCH</name>
              <description>desc MATCH</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>OV</name>
              <description>desc OV</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CAPF</name>
              <description>desc CAPF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICR</name>
          <description>Interrupt clean register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MATCHF</name>
              <description>desc MATCHF</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>OVF</name>
              <description>desc OVF</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPF</name>
              <description>desc CAPF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATE</name>
          <description>State register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CH3S</name>
              <description>desc CH3S</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2S</name>
              <description>desc CH2S</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1S</name>
              <description>desc CH1S</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CH3F</name>
              <description>desc CH3F</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CH2F</name>
              <description>desc CH2F</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>CH1F</name>
              <description>desc CH1F</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
