damowuhe/cw32l012_hal_cmake/cw32l012.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <description>desc I2C1</description>
      <baseAddress>0x40005800</baseAddress>
      <interrupt>
        <name>I2C1</name>
        <description>I2C1 Interrupt</description>
        <value>23</value>
      </interrupt>
      <groupName>I2C</groupName>
      <headerStructName>I2C</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x174</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>INSEL</name>
          <description>desc INSEL</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>SDAINSEL</name>
              <description>desc SDAINSEL</description>
              <msb>5</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SCLINSEL</name>
              <description>desc SCLINSEL</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR0</name>
          <description>desc MCR0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXFIFORST</name>
              <description>desc RXFIFORST</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFORST</name>
              <description>desc TXFIFORST</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>desc CLKSRC</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DBGEN</name>
              <description>desc DBGEN</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SLEEPEN</name>
              <description>desc SLEEPEN</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>desc RESET</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MEN</name>
              <description>desc MEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR1</name>
          <description>Master Control Register1</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RDMO</name>
              <description>desc RDMO</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CIRFIFO</name>
              <description>desc CIRFIFO</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR2</name>
          <description>Master Control Register2</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PINCFG</name>
              <description>desc PINCFG</description>
              <msb>26</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCFG</name>
              <description>desc MATCFG</description>
              <msb>18</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>desc TRGSEL</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMECFG</name>
              <description>desc TIMECFG</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNACK</name>
              <description>desc IGNACK</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AUTOSTOP</name>
              <description>desc AUTOSTOP</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESCALE</name>
              <description>desc PRESCALE</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR3</name>
          <description>Master Control Register3</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLTSDA</name>
              <description>desc FLTSDA</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTSCL</name>
              <description>desc FLTSCL</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BUSIDLE</name>
              <description>desc BUSIDLE</description>
              <msb>11</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR4</name>
          <description>Master Control Register4</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PINLOW</name>
              <description>desc PINLOW</description>
              <msb>19</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCCR</name>
          <description>Master Clock Control Register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>DATAVD</name>
              <description>desc DATAVD</description>
              <msb>29</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SETHOLD</name>
              <description>desc SETHOLD</description>
              <msb>21</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKHI</name>
              <description>desc CLKHI</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKLO</name>
              <description>desc CLKLO</description>
              <msb>5</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MMATCH</name>
          <description>Master Match Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MATCH1</name>
              <description>desc MATCH1</description>
              <msb>23</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MATCH0</name>
              <description>desc MATCH0</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MFIFOCR</name>
          <description>Master FIFO Control Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXWATER</name>
              <description>desc RXWATER</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXWATER</name>
              <description>desc TXWATER</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MFIFOSR</name>
          <description>Master FIFO Status Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RXCNT</name>
              <description>desc RXCNT</description>
              <msb>17</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXCNT</name>
              <description>desc TXCNT</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MTDR</name>
          <description>Master Tx Data Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CMD</name>
              <description>desc CMD</description>
              <msb>10</msb>
              <lsb>8</lsb>
              <access>write-only</access>
            </field>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MRDR</name>
          <description>Master Rx Data Register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EMPTY</name>
              <description>desc EMPTY</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MDER</name>
          <description>Master DMA Enable Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIER</name>
          <description>Master Interrupt Enable Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MATCH</name>
              <description>desc MATCH</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PINLOW</name>
              <description>desc PINLOW</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO</name>
              <description>desc FIFO</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBI</name>
              <description>desc ARBI</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>NACK</name>
              <description>desc NACK</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>desc STOP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PACKET</name>
              <description>desc PACKET</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISR</name>
          <description>Master Interrupt Status Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSBUSY</name>
              <description>desc BUSBUSY</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>MSTBUSY</name>
              <description>desc MSTBUSY</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>MATCH</name>
              <description>desc MATCH</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PINLOW</name>
              <description>desc PINLOW</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO</name>
              <description>desc FIFO</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ARBI</name>
              <description>desc ARBI</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>NACK</name>
              <description>desc NACK</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>STOP</name>
              <description>desc STOP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>PACKET</name>
              <description>desc PACKET</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MICR</name>
          <description>Master Interrupt Flag Clear Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MATCH</name>
              <description>desc MATCH</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PINLOW</name>
              <description>desc PINLOW</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO</name>
              <description>desc FIFO</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ARBI</name>
              <description>desc ARBI</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>NACK</name>
              <description>desc NACK</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>desc STOP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PACKET</name>
              <description>desc PACKET</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR0</name>
          <description>Slave Control Register0</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RXFIFORST</name>
              <description>desc RXFIFORST</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXFIFORST</name>
              <description>desc TXFIFORST</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>desc CLKSRC</description>
              <msb>7</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTEN</name>
              <description>desc FLTEN</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>desc RESET</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SEN</name>
              <description>desc SEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR1</name>
          <description>desc SCR1</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDRCFG</name>
              <description>desc ADDRCFG</description>
              <msb>18</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TRGSEL</name>
              <description>desc TRGSEL</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IGNACK</name>
              <description>desc IGNACK</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCFG</name>
              <description>desc RXCFG</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCFG</name>
              <description>desc TXCFG</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ALERTEN</name>
              <description>desc ALERTEN</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GCEN</name>
              <description>desc GCEN</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ACKSTALL</name>
              <description>desc ACKSTALL</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXSTALL</name>
              <description>desc TXSTALL</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXSTALL</name>
              <description>desc RXSTALL</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADRSTALL</name>
              <description>desc ADRSTALL</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
