damowuhe/cw32l012_hal_cmake/cw32l012.svd
        <register>
          <name>SCR2</name>
          <description>desc SCR2</description>
          <alternateRegister>MCR2</alternateRegister>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PINCFG</name>
              <description>desc PINCFG</description>
              <msb>26</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR3</name>
          <description>desc SCR3</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLTSDA</name>
              <description>desc FLTSDA</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FLTSCL</name>
              <description>desc FLTSCL</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DATAVD</name>
              <description>desc DATAVD</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKHOLD</name>
              <description>desc CLKHOLD</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMR</name>
          <description>desc SAMR</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR1</name>
              <description>desc ADDR1</description>
              <msb>26</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR0</name>
              <description>desc ADDR0</description>
              <msb>10</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAR</name>
          <description>desc STAR</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TXNACK</name>
              <description>desc TXNACK</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STDR</name>
          <description>desc STDR</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SRDR</name>
          <description>desc SRDR</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SOF</name>
              <description>desc SOF</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RXEMPTY</name>
              <description>desc RXEMPTY</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>DATA</name>
              <description>desc DATA</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SASR</name>
          <description>desc SASR</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ANV</name>
              <description>desc ANV</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RADDR</name>
              <description>desc RADDR</description>
              <msb>10</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SDER</name>
          <description>desc SDER</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ADDR</name>
              <description>desc ADDR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIER</name>
          <description>desc SIER</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ALERT</name>
              <description>desc ALERT</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GC</name>
              <description>desc GC</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AM1</name>
              <description>desc AM1</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AM0</name>
              <description>desc AM0</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO</name>
              <description>desc FIFO</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT</name>
              <description>desc BIT</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>desc STOP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESTART</name>
              <description>desc RESTART</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TACK</name>
              <description>desc TACK</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>desc ADDR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SISR</name>
          <description>desc SISR</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>BUSBUSY</name>
              <description>desc BUSBUSY</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>SLVBUSY</name>
              <description>desc SLVBUSY</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ALERT</name>
              <description>desc ALERT</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>GC</name>
              <description>desc GC</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>AM1</name>
              <description>desc AM1</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>AM0</name>
              <description>desc AM0</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFO</name>
              <description>desc FIFO</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>BIT</name>
              <description>desc BIT</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>STOP</name>
              <description>desc STOP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RESTART</name>
              <description>desc RESTART</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TACK</name>
              <description>desc TACK</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>desc ADDR</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SICR</name>
          <description>desc SICR</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FIFO</name>
              <description>desc FIFO</description>
              <msb>11</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>BIT</name>
              <description>desc BIT</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>STOP</name>
              <description>desc STOP</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RESTART</name>
              <description>desc RESTART</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
