damowuhe/cw32l012_hal_cmake/cw32l012.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART2</name>
      <description>desc UART2</description>
      <baseAddress>0x40001000</baseAddress>
      <interrupt>
        <name>UART2</name>
        <description>UART2 Interrupt</description>
        <value>28</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="UART1">
      <name>UART3</name>
      <description>desc UART3</description>
      <baseAddress>0x40002000</baseAddress>
      <interrupt>
        <name>UART3</name>
        <description>UART3 Interrupt</description>
        <value>29</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>LVD</name>
      <description>desc LVD</description>
      <baseAddress>0x400000A4</baseAddress>
      <interrupt>
        <name>LVD</name>
        <description>Low Voltage Detect Interrupt</description>
        <value>1</value>
      </interrupt>
      <headerStructName>LVD</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR0</name>
          <description>Control register0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLTCLK</name>
              <description>desc FLTCLK</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>VTH</name>
              <description>desc VTH</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOURCE</name>
              <description>desc SOURCE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ACTION</name>
              <description>desc ACTION</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>Control register1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLTTIME</name>
              <description>desc FLTTIME</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>FALL</name>
              <description>desc FALL</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>RISE</name>
              <description>desc RISE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>LEVEL</name>
              <description>desc LEVEL</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>IE</name>
              <description>desc IE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>status register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>FLTV</name>
              <description>desc FLTV</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>INTF</name>
              <description>desc INTF</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>OPA1</name>
      <description>desc OPA1</description>
      <baseAddress>0x400000B0</baseAddress>
      <groupName>OPA</groupName>
      <headerStructName>OPA</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>BIAS</name>
              <description>desc BIAS</description>
              <msb>15</msb>
              <lsb>13</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AMP</name>
              <description>desc AMP</description>
              <msb>12</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>INN2EN</name>
              <description>desc INN2EN</description>
              <msb>9</msb>
              <lsb>9</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>INN1EN</name>
              <description>desc INN1EN</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>INP4EN</name>
              <description>desc INP4EN</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>INP3EN</name>
              <description>desc INP3EN</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>INP2EN</name>
              <description>desc INP2EN</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>INP1EN</name>
              <description>desc INP1EN</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>MODE</name>
              <description>desc MODE</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAL</name>
          <description>desc CAL</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GTIM4OC2</name>
              <description>desc GTIM4OC2</description>
              <msb>31</msb>
              <lsb>31</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM4OC1</name>
              <description>desc GTIM4OC1</description>
              <msb>30</msb>
              <lsb>30</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM4TRGO</name>
              <description>desc GTIM4TRGO</description>
              <msb>29</msb>
              <lsb>29</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM3OC2</name>
              <description>desc GTIM3OC2</description>
              <msb>28</msb>
              <lsb>28</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM3OC1</name>
              <description>desc GTIM3OC1</description>
              <msb>27</msb>
              <lsb>27</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM3TRGO</name>
              <description>desc GTIM3TRGO</description>
              <msb>26</msb>
              <lsb>26</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM2OC2</name>
              <description>desc GTIM2OC2</description>
              <msb>25</msb>
              <lsb>25</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM2OC1</name>
              <description>desc GTIM2OC1</description>
              <msb>24</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM2TRGO</name>
              <description>desc GTIM2TRGO</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1OC2</name>
              <description>desc GTIM1OC2</description>
              <msb>22</msb>
              <lsb>22</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1OC1</name>
              <description>desc GTIM1OC1</description>
              <msb>21</msb>
              <lsb>21</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>GTIM1TRGO</name>
              <description>desc GTIM1TRGO</description>
              <msb>20</msb>
              <lsb>20</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIM1OC6</name>
              <description>desc ATIM1OC6</description>
              <msb>19</msb>
              <lsb>19</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIM1OC5</name>
              <description>desc ATIM1OC5</description>
              <msb>18</msb>
              <lsb>18</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIM1OC4</name>
              <description>desc ATIM1OC4</description>
              <msb>17</msb>
              <lsb>17</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ATIM1TRGO</name>
              <description>desc ATIM1TRGO</description>
              <msb>16</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC2START1</name>
              <description>desc ADC2START1</description>
              <msb>15</msb>
              <lsb>15</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC1START1</name>
              <description>desc ADC1START1</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKDIV</name>
              <description>desc CLKDIV</description>
              <msb>13</msb>
              <lsb>11</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>AZRUN</name>
              <description>desc AZRUN</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-only</access>
            </field>
            <field>
              <name>ADCSTART</name>
              <description>desc ADCSTART</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALPERIOD</name>
              <description>desc CALPERIOD</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTTRIG </name>
              <description>desc SOFTTRIG </description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>START </name>
              <description>desc START </description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALMODE</name>
              <description>desc CALMODE</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>CALEN</name>
              <description>desc CALEN</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
