damowuhe/cw32l012_hal_cmake/cw32l012.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>VC12REF</name>
      <description>desc VC12REF</description>
      <baseAddress>0x40000080</baseAddress>
      <groupName>VC</groupName>
      <headerStructName>VC2REF</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>REF</name>
          <description>VCREF Control register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>VIN</name>
              <description>desc VIN</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>DIV</name>
              <description>desc DIV</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="VC1">
      <name>VC2</name>
      <description>desc VC2</description>
      <baseAddress>0x40000094</baseAddress>
      <interrupt>
        <name>VC24</name>
        <description>Voltage Comparator 2/4 Interrupt</description>
        <value>15</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="VC1">
      <name>VC3</name>
      <description>desc VC3</description>
      <baseAddress>0x40000184</baseAddress>
      <interrupt>
        <name>VC13</name>
        <description>Voltage Comparator 1/3 Interrupt</description>
        <value>14</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="VC12REF">
      <name>VC34REF</name>
      <description>desc VC34REF</description>
      <baseAddress>0x40000180</baseAddress>
    </peripheral>
    <peripheral derivedFrom="VC1">
      <name>VC4</name>
      <description>desc VC4</description>
      <baseAddress>0x40000194</baseAddress>
      <interrupt>
        <name>VC24</name>
        <description>Voltage Comparator 2/4 Interrupt</description>
        <value>15</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>WWDT</name>
      <description>desc WWDT</description>
      <baseAddress>0x40005400</baseAddress>
      <interrupt>
        <name>WDT</name>
        <description>Watch Dog Timer Interrupt</description>
        <value>0</value>
      </interrupt>
      <groupName>WDT</groupName>
      <headerStructName>WWDT</headerStructName>
      <size>32</size>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x0C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR0</name>
          <description>Control register0</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>EN</name>
              <description>desc EN</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WCNT</name>
              <description>desc WCNT</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR1</name>
          <description>Control register1</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>IE</name>
              <description>desc IE</description>
              <msb>10</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>PRS</name>
              <description>desc PRESCALE</description>
              <msb>9</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <field>
              <name>WINR</name>
              <description>desc WINR</description>
              <msb>6</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>status register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>POV</name>
              <description>desc POV</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
</device>